# Semiu A. Biliaminu

# ID: 16e7d4e4bcc1f000

In [ ]:
import pandas as pd

food_df = pd.read_csv('~/hamoye/FoodBalanceSheets_E_Africa_NOFLAG.csv', encoding='Latin')

In [7]:
food_df

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28
...,...,...,...,...,...,...,...,...,...,...,...,...
60938,181,Zimbabwe,2899,Miscellaneous,5142,Food,1000 tonnes,42.00,46.00,33.00,19.00,16.00
60939,181,Zimbabwe,2899,Miscellaneous,645,Food supply quantity (kg/capita/yr),kg,3.06,3.33,2.35,1.33,1.08
60940,181,Zimbabwe,2899,Miscellaneous,664,Food supply (kcal/capita/day),kcal/capita/day,3.00,4.00,3.00,1.00,1.00
60941,181,Zimbabwe,2899,Miscellaneous,674,Protein supply quantity (g/capita/day),g/capita/day,0.10,0.11,0.08,0.04,0.04
60942,181,Zimbabwe,2899,Miscellaneous,684,Fat supply quantity (g/capita/day),g/capita/day,0.04,0.05,0.03,0.02,0.01

# Which of the following is a python inbuilt module?

Math

Matplotlib

Seaborn

Pandas

# ANSWER: Math

# A pandas Dataframe with dimensions (100,3) has how many features and observations?

# ANSWER: 3 features, 100 observations

# Select columns â€˜Y2017â€™ and â€˜Areaâ€™, Perform a groupby operation on â€˜Areaâ€™. 
# Which of these Areas had the 7th lowest sum in 2017?

# ANSWER: Guinea-Bissau has the 7th lowest sum in 2017

In [59]:
food_df[['Area','Y2017']].groupby('Area').sum().sort_values(ascending=True, by='Y2017').head(7)

                          Y2017
Area
Sudan (former)             0.00
Ethiopia PDR               0.00
Comoros                   59.84
Seychelles               442.34
Sao Tome and Principe  12662.63
Cabo Verde             14650.74
Guinea-Bissau          19102.77

# Perform a groupby operation on â€˜Elementâ€™.  What year has the highest sum of Stock Variation?

# ANSWER:

In [ ]:
food_df.groupby('Element')[['Y2018','Y2017','Y2016','Y2015','Y2014']].value_counts().sort_values(ascending=False)

In [327]:
food_df.groupby(['Y2018','Y2017','Y2016','Y2015','Y2014'])['Element'].value_counts().sort_values(ascending=False)

Y2018     Y2017     Y2016     Y2015     Y2014     Element
0.0       0.0       0.0       0.0       0.0       Residuals                                 3924
                                                  Stock Variation                           1887
                                                  Protein supply quantity (g/capita/day)    1751
                                                  Fat supply quantity (g/capita/day)        1690
                                                  Import Quantity                           1545
                                                                                            ...
3.0       2.0       1.0       2.0       2.0       Domestic supply quantity                     1
                              1.0       2.0       Import Quantity                              1
                                                  Food supply (kcal/capita/day)                1
                                        1.0       Food supply (kcal/capita/day)                1
195875.0  190873.0  185960.0  181137.0  176405.0  Total Population - Both sexes                1
Name: Element, Length: 27430, dtype: int64

In [101]:
food_df['Element'].apply(lambda x: x.split(" "))

0                [Total, Population, -, Both, sexes]
1                       [Domestic, supply, quantity]
2                  [Food, supply, (kcal/capita/day)]
3        [Protein, supply, quantity, (g/capita/day)]
4            [Fat, supply, quantity, (g/capita/day)]
                            ...
60938                                         [Food]
60939       [Food, supply, quantity, (kg/capita/yr)]
60940              [Food, supply, (kcal/capita/day)]
60941    [Protein, supply, quantity, (g/capita/day)]
60942        [Fat, supply, quantity, (g/capita/day)]
Name: Element, Length: 60943, dtype: object

# Given the following python code, what would the output of the code give?

# ANSWER: Type Error

In [102]:
my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

TypeError: 'tuple' object does not support item assignment

# Select columns â€˜Y2017â€™ and â€˜Areaâ€™, Perform a groupby operation on â€˜Areaâ€™. 
# Which of these Areas had the highest sum in 2017?

# ANSWER:  Nigeria is had the highest sum in 2017

In [108]:
food_df[['Area','Y2017']].groupby('Area').sum().sort_values(ascending=False, by='Y2017').head(1)

              Y2017
Area
Nigeria  1483268.23

# What is the mean and standard deviation across the whole dataset for the year 2017 to 2 decimal places?

# ANSWER: 140.92 and 1671.86

In [121]:
round(food_df['Y2017'].mean(),2)

140.92

In [120]:
round(food_df['Y2017'].std(),2)

1671.86

# What is the total number of unique countries in the dataset?
# ANSWER: 49

In [126]:
len(food_df['Area'].value_counts())

49

# What would be the output for?

# S = [['him', 'sell'], [90, 28, 43]]

# S[0][1][1]

# ANSWER: e

In [127]:
S = [['him', 'sell'], [90, 28, 43]]
S[0][1][1]

'e'

# Consider the following list of tuples:

# y = [(2, 4), (7, 8), (1, 5, 9)]

# How would you assign element 8 from the list to a variable x?

# ANSWER:  x = y[1][1]

In [139]:
y = [(2, 4), (7, 8), (1, 5, 9)]

x = y[1][1]

In [140]:
x

8

# Perform a groupby operation on â€˜Elementâ€™.  What is the total number of the sum of Processing in 2017?

# ANSWER: 292836.00

In [179]:
food_df.groupby('Element')[['Element','Y2017']].sum()

#OR

food_df.groupby('Element')['Y2017'].sum()

                                             Y2017
Element
Domestic supply quantity                2088198.10
Export Quantity                          182338.80
Fat supply quantity (g/capita/day)        10253.84
Feed                                     223705.68
Food                                    1258888.28
Food supply (kcal/capita/day)            454681.00
Food supply quantity (kg/capita/yr)       48690.04
Import Quantity                          294559.09
Losses                                   160614.00
Other uses (non-food)                     91645.97
Processing                               292836.00
Production                              2030056.89
Protein supply quantity (g/capita/day)    11842.45
Residuals                                 35500.00
Seed                                      24870.14
Stock Variation                           54316.91
Total Population - Both sexes           1112641.00
Tourist consumption                          91.00

# What is the total number and percentage of missing data in 2014 to 3 decimal places?

# ANSWER: 1589 and 2.607%

In [189]:
food_df['Y2014'].isna().value_counts()

False    59354
True      1589
Name: Y2014, dtype: int64

In [191]:
round((1589/59354)*100,3)

2.677

# Which year had the least correlation with â€˜Element Codeâ€™?

# ANSWER: 0.023444 (Y2016)

In [192]:
food_df.corr()

,Area Code,Item Code,Element Code,Y2014,Y2015,Y2016,Y2017,Y2018
Area Code,1.000000,-0.005159,-0.000209,0.006164,0.005472,0.005247,0.005006,0.005665
Item Code,-0.005159,1.000000,-0.024683,0.021722,0.020857,0.020109,0.021494,0.021314
Element Code,-0.000209,-0.024683,1.000000,0.024457,0.023889,0.023444,0.024254,0.024279
Y2014,0.006164,0.021722,0.024457,1.000000,0.994647,0.996081,0.995230,0.994872
Y2015,0.005472,0.020857,0.023889,0.994647,1.000000,0.995739,0.988048,0.988208
Y2016,0.005247,0.020109,0.023444,0.996081,0.995739,1.000000,0.992785,0.992757
Y2017,0.005006,0.021494,0.024254,0.995230,0.988048,0.992785,1.000000,0.998103
Y2018,0.005665,0.021314,0.024279,0.994872,0.988208,0.992757,0.998103,1.000000

# Which of the following dataframe methods can be used to access elements across rows and columns?

df.iloc[ : ] 

df.loc( : )

c and d

df.iloc( )

df.loc( )

# ANSWER: df.iloc[:]

In [209]:
food_df.iloc[:]

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28
...,...,...,...,...,...,...,...,...,...,...,...,...
60938,181,Zimbabwe,2899,Miscellaneous,5142,Food,1000 tonnes,42.00,46.00,33.00,19.00,16.00
60939,181,Zimbabwe,2899,Miscellaneous,645,Food supply quantity (kg/capita/yr),kg,3.06,3.33,2.35,1.33,1.08
60940,181,Zimbabwe,2899,Miscellaneous,664,Food supply (kcal/capita/day),kcal/capita/day,3.00,4.00,3.00,1.00,1.00
60941,181,Zimbabwe,2899,Miscellaneous,674,Protein supply quantity (g/capita/day),g/capita/day,0.10,0.11,0.08,0.04,0.04
60942,181,Zimbabwe,2899,Miscellaneous,684,Fat supply quantity (g/capita/day),g/capita/day,0.04,0.05,0.03,0.02,0.01

# How would you check for the number of rows and columns in a pandas DataFrame named df?

# ANSWER: food_df.shape

In [211]:
food_df.shape

(60943, 12)

# If you have the following list

# lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

# col = [â€˜Ageâ€™,â€™Nationalityâ€™,â€™Overallâ€™]

# How do you create a pandas DataFrame using this list, to look like the table below?

# ANSWER:  pd.Dataframe(lst, columns = col, index = [1,2,3])

In [221]:
lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

col = ["Age","Nationality","Overall"]

pd.DataFrame(lst, columns = col, index = [i for i in range(1,4)])

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

# Which of these python data structures is unorderly?

# ANSWER: list

# Given the following numpy array 

# array  = ([[94, 89, 63],

#             [93, 92, 48],

#             [92, 94, 56]])

# How would you select  the elements in bold and italics from the array?

# ANSWER: NO answer

In [222]:
array  = ([[94, 89, 63],[93, 92, 48],[92, 94, 56]])

In [266]:
array[:2:]

[[94, 89, 63], [93, 92, 48]]

# What is the total Protein supply quantity in Madagascar in 2015?

# ANSWER:

In [316]:
#food_df['Area'] == 'Madagascar' == food_df['Item'] == 'Protein'

food_df[food_df['Area'] == 'Madagascar'][['Item','Y2015']] == 'Protein'

       Item  Y2015
30715  True  False
30716  True  False
30717  True  False
30718  True  False
30719  True  False
...     ...    ...
32149  True  False
32150  True  False
32151  True  False
32152  True  False
32153  True  False

[1439 rows x 2 columns]

# What is the total sum of Wine produced in 2015 and 2018 respectively?

# Hint:

# Perform a groupby sum aggregation on â€˜Itemâ€™

# ANSWER: Wine (4251.81 and 4039.32)

In [291]:
food_df.groupby('Item')[['Y2015','Y2018']].sum()

                         Y2015      Y2018
Item
Alcohol, Non-Food      2180.00    2293.00
Alcoholic Beverages   98783.72   97847.27
Animal Products       11811.73   11578.61
Animal fats          200675.72  269648.27
Apples and products   10559.15    9640.51
...                        ...        ...
Vegetables, Other    158104.08  163987.21
Vegetal Products     107064.17  107775.39
Wheat and products   234710.51  242645.19
Wine                   4251.81    4039.32
Yams                 203151.78  221272.09

[119 rows x 2 columns]